from hero import Hero, Fox
from time import sleep

karma = 0


ng = input("Введіть ім'я головному герою:")
cg = int(input("""Виберіть статуру головному герою, є три види статури:
1 - Худий. 
2 - Баланс.
3 - Товстий.

(Для вибору статури введіть потрібну цифру):
"""))
if cg == 1:
  hero1 = Hero(ng, 40, 10, 10, "Кинжал", "Худий")
elif cg == 2:
  hero1 = Hero(ng, 50, 10, 15, "Спис", "Баланс")
elif cg == 3:
  hero1 = Hero(ng, 65, 5, 20, "Меч", "Товстий")
else:
  print ("Такої статури немає :/")
#name, health, power1, power2, armor, weapon1, weapon2, stature
#hero2 = Sponge("Sponge Bob", 50, 5, 10, 'Soap buble', 'ПАм пам')
hero3 = Fox("Лисиця", 25, 10, 5, "Укус", "Тварина")

print("Ваш персонаж:")
hero1.print_info()
print("\n")
sleep(3)
print ("\nТьма сирої осінньої ночі ледь просвічувалась холодним місячним сяйвом, хоча й його перекривали густі листя дерев, а до цього додавалась моторошна, навіть цвинтарна тиша, яку перебивали тільки звуки ступаючих по багнюці чоботів.")
sleep(5)
print (ng, "ступав по болотистій стежині посеред лісу, напруга відчувалась у кожній клітині його тіла, страх майже сковував його тіло, але він уже не міг повернутись назад. Йому більше не було куди повертатися.")
sleep(5)
if cg == 1:
  print("Але навіть попри це,", ng,",відганняв погані думки, і навіть, якщо б місячне світло дало змогу побачити його очі, у них не було суму, у них не було нічого. Пустий погляд в нікуди навіть не старався роздивитися непроглядний шлях, він механічно йшов далі не задумуючись ні про що, а його рука все міцніше і міцніше стискала гострий кинжал, пальці щосили впиралися в його ручку, аж до болі пропитуючи кісточки фаланг пальців.")
elif cg == 2:
  print("Але навіть попри це,", ng,",відганняв погані думки, і навіть, якщо б місячне світло дало змогу побачити його очі, у них не було суму, у них не було нічого. Пустий погляд в нікуди навіть не старався роздивитися непроглядний шлях, він механічно йшов далі не задумуючись ні про що, а його рука все міцніше і міцніше стискала довгий спис, пальці щосили впиралися в нього, аж до болі пропитуючи кісточки фаланг пальців.")
elif cg == 3:
  print("Але навіть попри це,", ng,",відганняв погані думки, і навіть, якщо б місячне світло дало змогу побачити його очі, у них не було суму, у них не було нічого. Пустий погляд в нікуди навіть не старався роздивитися непроглядний шлях, він механічно йшов далі не задумуючись ні про що, а його рука все міцніше і міцніше стискала меч, пальці щосили впиралися в його руків'я, аж до болі пропитуючи кісточки фаланг пальців.")

sleep(5)
print("Збоку почувся шелест опалого листя, серце на мить замерло, дихання почастішало, а місяць освітив величезний силует.")
sleep(3)
print("На стежку вибігло ніщо інше як здоровенна лисиця, яка була готова напасти, і роздерти свою здобич.")
sleep(3)
print("\n")
print("Ваш cупротивник:")
hero3.print_info()
hero1.fight(hero3)
sleep(3)
print ("Лисиця лежить на землі, уривчасто дихаючи, світло місяця відблискувало від її хутра, залишається останній удар...")
sleep(3)
print ("Ще недавно лисиця була готова розірвати на кусочки свою здобич, але ось вона сама стала здобиччю, і її доля вирішиться наступної миті, якщо залишити її живою, невідомо чи вона не намагатиметься знову виконати свою ціль.")
fox_l_d = int(input("""Що зробити з лисицею?
1 - вбити.
2 - залишити як є.
"""))
if fox_l_d == 1:
  fox_live = 0
  if cg == 1:
    print ("Коротке лезо кинжалу блиснуло у майже непроглядній темноті, і цівка крові бризнула на пошарпане хутро, ще більше оплямовуючи його, а погляд лисиці, хоч цього й не було видно крізь темряву, помутнів.")
    sleep(3)
    print ("~Більше вона не буде загрозою для мене~")
    sleep(3)
  if cg == 2:
    print ("Наконечник спису блиснув у майже непроглядній темноті, секуда... і зброя проткнула м'яке тіле, забивгись у землю, цівка крові бризнула на пошарпане хутро, ще більше оплямовуючи його, а погляд лисиці, хоч цього й не було видно крізь темряву, помутнів.")
    sleep(3)
    print ("~Більше вона не буде загрозою для мене~")
    sleep(3)
  if cg == 3:
    print ("Гостре лезо меча блиснуло у майже непроглядній темноті, і цівка крові бризнула на пошарпане хутро, ще більше оплямовуючи його, а погляд лисиці, хоч цього й не було видно крізь темряву, помутнів.")
    sleep(3)
    print ("~Більше вона не буде загрозою для мене~")
    sleep(3)

elif fox_l_d == 2:
  karma = +1
  fox_live = 0
  print ("Співчуття до свого ворога все ж бере верх, потрібно вміти прощати провини, навіть якщо в майбутньому вони можуть зашкодити тобі.")
  sleep(3)
print  ("Ще мить і знову,", ng, "продовжує свій шлях по темному, моторошному лісі.")
sleep(3)
print ("...")
sleep(3)
print("Через деякий час, можливо пів години, а можливо й десять,", ng,"вийшов на дорогу, звичайну асфальтовану дорогу.")
sleep(2)

left_or_right_way = int(input("""В яку ж сторону піти? Праворуч чи ліворуч, ліворуч чи праворуч...
1 - праворуч.
2 - ліворуч.
3 - повернутись назад, у ліс.
"""))
if left_or_right_way == 1:
  print("Значить праворуч...")
  sleep(2)
  print ("Дорога тягнулася нескінченною полосою вздовж полів, жодної живої душі, або навіть натяку на неї вселювали потужний, навіть тваринний страх. Страх затуманює розум, людина підвладна страху не контролює себе та свої емоції.")
  sleep(2)
  print("Але через деякий час за горизонтом побачився будинок, а за ним ще один, і ще, і ще")
  sleep(2)
  print (ng,"відчув невимовну радість, і бадьоро пришвидшив темп свого руху")
  sleep(2)
  if karma == 1:
    print ("Через деякий час,", ng,",вже був у місті, з часом повернувшись до нормального життя, та навіть здобувши певний матеріальний достаток")
  else:
    print("З лісу вибігла зграя лисиць, роздерши на шматочки людину, таким чином помстившись за вбиту лисицю.")
    sleep(2)
    print("Game Over")

elif left_or_right_way == 2:
  print("Значить ліворуч...")
  sleep(2)
  print ("Дорога тягнулася нескінченною полосою вздовж полів, жодної живої душі, або навіть натяку на неї вселювали потужний, навіть тваринний страх. Страх затуманює розум, людина підвладна страху не контролює себе та свої емоції.")
  sleep(2)
  print("Дорога обірвалась стрімкою річкою, це був глухий кут, потрібно повертатись...")
  sleep(2)
  print("~Ось я знову на цьому ж місці~")
  right_of_back = int(input("""Куди ж піти цього разу?..
  1 - Праворуч.
  2 - Повернутись у ліс."""))
  if right_of_back == 1:
    print("Але через деякий час за горизонтом побачився будинок, а за ним ще один, і ще, і ще")
    sleep(2)
    print (ng,"відчув невимовну радість, і бадьоро пришвидшив темп свого руху")
    sleep(2)
    if karma == 1:
      print ("Через деякий час,", ng,",вже був у місті, з часом повернувшись до нормального життя, та навіть здобувши певний матеріальний достаток")
    else:
      print("З лісу вибігла зграя лисиць, роздерши на шматочки людину, таким чином помстившись за вбиту лисицю.")
      sleep(2)
      print("Game Over")
  elif right_of_back == 2:
    if fox_live == 1:
      print ("Зайшовщи у ліс, та ступивши декілька сотень кроків,", ng,"почув дивне шуродіння, а через декілька митей на нього вискочила та сама лисиця, але вона була не сама, разом із собою вона привела цілу зграю, тобто шансів на життя більше не було...")
      sleep(2)
      print("Game Over")
    else:
      print ("Зайшовщи у ліс, та ступивши декілька сотень кроків,", ng,"почув дивне тупотіння, а через декілька митей вибігла зграя лисиць, роздерши на шматочки людину, таким чином помстившись за вбиту лисицю.")
      sleep(2)
      print("Game Over")
elif left_or_right_way == 3:
  if fox_live == 1:
    print ("Зайшовщи у ліс, та ступивши декілька сотень кроків,", ng,"почув дивне шуродіння, а через декілька митей на нього вискочила та сама лисиця, але вона була не сама, разом із собою вона привела цілу зграю, тобто шансів на життя більше не було...")
    sleep(2)
    print("Game Over")
  else:
    print ("Зайшовщи у ліс, та ступивши декілька сотень кроків,", ng,"почув дивне тупотіння, а через декілька митей вибігла зграя лисиць, роздерши на шматочки людину, таким чином помстившись за вбиту лисицю.")
    sleep(2)
    print("Game Over")
    
